Revit 2027 API
BuiltInFailures.StairRampFailures.StairsSupportTooShort Property
 A short support is being created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsSupportTooShort { get; }
Public Shared ReadOnly Property StairsSupportTooShort As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsSupportTooShort {
	FailureDefinitionId^ get ();
}
static member StairsSupportTooShort : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace